//CBL0015J JOB 1,NOTIFY=&SYSUID,CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(CBL0015),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(CBL0015),DISP=SHR
//* ---------------------------------------------------------------
//RUN     EXEC PGM=CBL0015,TIME=(0,05),REGION=0M
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=200
//CEEDUMP   DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
