//HELLOCBL JOB  1,NOTIFY=&SYSUID
//***************************************************/
//* Copyright Contributors to the COBOL Programming Course 
//* SPDX-License-Identifier: CC-BY-4.0
//***************************************************/
//COBRUN   EXEC IGYWCLG,SRC=HELLO
