//PAYROL0X JOB  1,NOTIFY=&SYSUID
//***************************************************/
//* Copyright Contributors to the COBOL Programming Course 
//* SPDX-License-Identifier: CC-BY-4.0
//***************************************************/
//PAYROLL  EXEC IGYWCLG,SRC=PAYROL0X
